---
kind: type
id: T:Autodesk.Revit.Exceptions.ArgumentException
source: html/2e6e4206-97a8-dd4b-df5d-4269f4bb6088.htm
---
# Autodesk.Revit.Exceptions.ArgumentException

The exception that is thrown when one of the arguments provided to a method is not valid.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ArgumentException : ApplicationException
```

## Remarks
This is the base class for exceptions that are thrown while validating the arguments to a function.